IdeaRS.OpenModel.Concrete.CheckResult.CalculationType
Calculation type

IdeaRS.OpenModel.Concrete.CheckResult.CalculationType.NotDefined
not defined check

IdeaRS.OpenModel.Concrete.CheckResult.CalculationType.Capacity
calculation of capacity by the interaction diagram

IdeaRS.OpenModel.Concrete.CheckResult.CalculationType.Response
calculation plane of deformation

IdeaRS.OpenModel.Concrete.CheckResult.CalculationType.Shear
shear check

IdeaRS.OpenModel.Concrete.CheckResult.CalculationType.Torsion
torsion check

IdeaRS.OpenModel.Concrete.CheckResult.CalculationType.Interaction
interaction shear+torsion

IdeaRS.OpenModel.Concrete.CheckResult.CalculationType.Fatigue
calculation - response for fatigue

IdeaRS.OpenModel.Concrete.CheckResult.CalculationType.StressLimitationShort
stress limitation check - short

IdeaRS.OpenModel.Concrete.CheckResult.CalculationType.StressLimitationLong
stress limitation check - long

IdeaRS.OpenModel.Concrete.CheckResult.CalculationType.StressLimitationStage
stress limitation check - stage

IdeaRS.OpenModel.Concrete.CheckResult.CalculationType.CrackWidthShort
crack width check - short

IdeaRS.OpenModel.Concrete.CheckResult.CalculationType.CrackWidthLong
crack width check - long

IdeaRS.OpenModel.Concrete.CheckResult.CalculationType.CrackWidthStage
crack width check - stage

IdeaRS.OpenModel.Concrete.CheckResult.CalculationType.StiffnessShort
stiffness calculation - short

IdeaRS.OpenModel.Concrete.CheckResult.CalculationType.StiffnessLong
stiffness calculation - long

IdeaRS.OpenModel.Concrete.CheckResult.CalculationType.StiffnessStage
stiffness calculation - stage

IdeaRS.OpenModel.Concrete.CheckResult.CalculationType.Deflection
deflection check

IdeaRS.OpenModel.Concrete.CheckResult.CalculationType.BrittleFailure
brittle failure check

IdeaRS.OpenModel.Concrete.CheckResult.CalculationType.Detailing
detailing check

IdeaRS.OpenModel.Concrete.CheckResult.CalculationType.LinearStressShort
Linear stress check - short

IdeaRS.OpenModel.Concrete.CheckResult.CalculationType.LinearStressLong
Linear stress check - long

IdeaRS.OpenModel.Concrete.CheckResult.CalculationType.LinearStressStage
Linear stress check - stage

IdeaRS.OpenModel.Concrete.CheckResult.CalculationType.CrossSectionCharacteristicsShort
calculation cross-section characteristics - short

IdeaRS.OpenModel.Concrete.CheckResult.CalculationType.CrossSectionCharacteristicsLong
calculation cross-section characteristics - long

IdeaRS.OpenModel.Concrete.CheckResult.CalculationType.CrossSectionCharacteristicsStage
calculation cross-section characteristics - stage

IdeaRS.OpenModel.Concrete.CheckResult.CalculationType.Baumann
calculation internal forces for slabs/shells/walls

IdeaRS.OpenModel.Concrete.CheckResult.CalculationType.OverallColumnRecalculation
all internal forces are recalculated because of slenderness/imperfections etc...

IdeaRS.OpenModel.Concrete.CheckResult.CalculationType.ColumnForces
Recalculation of internal forces on compression members (effect of geometric imperfections and second order effect).

IdeaRS.OpenModel.Concrete.CheckResult.CalculationType.PrestressEffects
calculation prestress effects

IdeaRS.OpenModel.Concrete.CheckResult.CalculationType.Primaryforces
calculation primary forces

IdeaRS.OpenModel.Concrete.CheckResult.CalculationType.LongTermLosses
calculation long term losses calculation

IdeaRS.OpenModel.Concrete.CheckResult.CalculationType.MNKappaDiagramULS
calculation M-N-Kappa diagram ULS

IdeaRS.OpenModel.Concrete.CheckResult.CalculationType.MNKappaDiagramSLSShort
calculation M-N-Kappa diagram SLS-short

IdeaRS.OpenModel.Concrete.CheckResult.CalculationType.MNKappaDiagramSLSLong
calculation M-N-Kappa diagram SLS-long

IdeaRS.OpenModel.Concrete.CheckResult.CalculationType.CreepAndShrinkageCoefficient
calculation of creep and shrinkage

IdeaRS.OpenModel.Concrete.CheckResult.CalculationType.ConcreteCover
calculation of creep and shrinkage

IdeaRS.OpenModel.Concrete.CheckResult.CalculationType.CrackingCalculation
calculation if cross section is cracked

IdeaRS.OpenModel.Concrete.CheckResult.CalculationType.CrackingCalculationShort
calculation if cross section is cracked

IdeaRS.OpenModel.Concrete.CheckResult.CalculationType.CrackingCalculationLong
calculation if cross section is cracked

IdeaRS.OpenModel.Concrete.CheckResult.CalculationType.Redistribution
calculation of redistribution

IdeaRS.OpenModel.Concrete.CheckResult.CalculationType.InitilaStateofCrossSection
initial state of cross-section

IdeaRS.OpenModel.Concrete.CheckResult.CalculationType.StrutAngle
angle of concrete strut

IdeaRS.OpenModel.Concrete.CheckResult.CalculationType.DesignReinforcement
desing of reinforcement

IdeaRS.OpenModel.Concrete.CheckResult.CalculationType.CapacityMesh
interaction diagram on mesh

IdeaRS.OpenModel.Concrete.CheckResult.CalculationType.StiffnessStageLong
calculation siffness with effective modulus of elasticity

IdeaRS.OpenModel.Concrete.CheckResult.CalculationType.LongTermLossesCoefficient
calculation long-term losses coefficient